/*
  การกระพริบ

  การเปิดหลอด LED ในช่วงเวลา 1 วินาทีหรือการปิดหลอด LED ในช่วงเวลา 1 วินาที
  โดยบอร์ด Arduinos จะมี LED อยู่บนตัวอุปกรณ์ ซึ่งเราสามารถควบคุมการเปิดปิดหลอดได้โดยตรง โดยเรียกใช้จากตัวแปรที่มีชื่อว่า LED_BUILTIN
  ถ้าอยากรู้ว่าแต่ละบอร์ดมีอุปกรณ์หรือคุณสมบัติต่าง ๆ สามารถเข้าไปดูรายละเอียดได้ที่ https://www.arduino.cc/en/Main/Products

*/

// ส่วนของการตั้งค่าจะตั้งค่าใหม่ทุกครั้งเมื่อมีการรีเซ็ต
void setup() {
  /*คำสั่งการกำหนดชนิดของขาอุปกรณ์ 
  โดยใช้คำสั่ง pinMode และจะตามด้วยตัวแปรหรือตำแหน่งขา (LED_BUILTIN, 
  และตามต่อด้วยสถานะ OUTPUT)และปิดท้ายตด้วยเซมิโคลอน ;
  */
  pinMode(LED_BUILTIN, OUTPUT);
}

// ส่วนของการทำงานที่ละบรรทัดและจะทำงานวนลูปไปเรื่อย ๆ
void loop() {
  digitalWrite(LED_BUILTIN, HIGH);   // คำสั่งกำหนดให้ตัวแปรหรือตำแหน่งขามีสถานะเป็น HIGH 
  delay(1000);                       // ฟังก์ชันการหน่วงเวลา
  digitalWrite(LED_BUILTIN, LOW);    // คำสั่งกำหนดให้ตัวแปรหรือตำแหน่งขามีสถานะเป็น LOW 
  delay(1000);                       // ฟังก์ชันการหน่วงเวลา
}
